public_html/Algorithms/TheoryOfAlgorithms/Misc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Misc</title>
<!-- 2016-11-08 Tue 23:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Misc</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">GUID generation</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">GUID generation</h2>
<div class="outline-text-2" id="text-1">
<p>
Generate globally unique identifiers(GUIDs) and can be decrypted.<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #98fb98;">void</span> <span style="color: #7fffd4;">GUID</span>::<span style="color: #87cefa;">GenerateUnique</span>()
{
    <span style="color: #98fb98;">Time</span> <span style="color: #eedd82;">Time</span>;
    GetTime(Time);

    <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">tU16</span> <span style="color: #eedd82;">StaticMask</span> = 0;
    StaticMask = InterlockedIncrement(StaticMask);

    A = GUUID;
    B = GMACAddress &gt;&gt; 16;
    C = (StaticMask &lt;&lt; 16) | (GMACAddress &amp; 0xffff);
    D = (Time.Second + Time.Minute * 60 + Time.Hour * 60 * 60) | (Time.Month &lt;&lt; 17) | (Time.Day &lt;&lt; 22) | ((Time.Year - 2011) &lt;&lt; 27);

    <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Simple encryption</span>
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Mask</span> = (StaticMask &lt;&lt; 16) | ((StaticMask * 0x0bb38435) + 0x3619636b);
    A = ~A ^ Mask;
    B = ~B ^ Mask;
    C = ~C ^ StaticMask; <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">don't encrypt the mask itself</span>
    D = ~D ^ Mask;
}

<span style="color: #98fb98;">String</span> <span style="color: #7fffd4;">GUID</span>::<span style="color: #87cefa;">GetDescStr</span>() <span style="color: #00ffff;">const</span>
{
    <span style="color: #98fb98;">tU16</span> <span style="color: #eedd82;">StaticMask</span> = ~(C &gt;&gt; 16);
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Mask</span> = (StaticMask &lt;&lt; 16) | (StaticMask * 0x0bb38435) + 0x3619636b;
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Mac0</span> = ~(B ^ Mask);
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Mac1</span> = ~(C ^ StaticMask);

    <span style="color: #98fb98;">String</span> <span style="color: #eedd82;">Result</span> = <span style="color: #7fffd4;">String</span>::Printf(
        <span style="color: #ffa07a;">"UUID:%08x MAC:%02x-%02x-%02x-%02x-%02x-%02x "</span>,
        ~(A ^ Mask),
        (<span style="color: #98fb98;">tU32</span>)((Mac0 &amp; 0xff000000) &gt;&gt; 24),
        (<span style="color: #98fb98;">tU32</span>)((Mac0 &amp; 0xff0000) &gt;&gt; 16),
        (<span style="color: #98fb98;">tU32</span>)((Mac0 &amp; 0xff00) &gt;&gt; 8),
        (<span style="color: #98fb98;">tU32</span>)((Mac0 &amp; 0xff)),
        (<span style="color: #98fb98;">tU32</span>)((Mac1 &amp; 0xff00) &gt;&gt; 8),
        (<span style="color: #98fb98;">tU32</span>)((Mac1 &amp; 0xff))
    );

    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Timestamp</span> = ~(D ^ Mask);
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Seconds</span> = (Timestamp &amp; 0x1ffff);
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Month</span> = ((Timestamp &gt;&gt; 17) &amp; 0x1f);
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Day</span> = ((Timestamp &gt;&gt; 22) &amp; 0x1f);
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Year</span> = (Timestamp &gt;&gt; 27) + 2011;
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Hour</span> = (Seconds / (60 * 60));
    Seconds -= Hour * 60 * 60;
    <span style="color: #98fb98;">tU32</span> <span style="color: #eedd82;">Minute</span> = (Seconds / 60);
    Seconds -= Minute * 60;

    Result += <span style="color: #7fffd4;">String</span>::Printf(<span style="color: #ffa07a;">"Date:%d-%02d-%02d %d:%02d:%02d "</span>, Year, Month, Day, Hour, Minute, Seconds);
    Result += <span style="color: #7fffd4;">String</span>::Printf(<span style="color: #ffa07a;">"Mask:0x%08x"</span>, Mask);

    <span style="color: #00ffff;">return</span> Result;
}
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://jfdube.wordpress.com/2011/09/21/guid-generation/">http://jfdube.wordpress.com/2011/09/21/guid-generation/</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-11-08 Tue 23:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
